Tekla Open API Reference for Tekla Structures 2025
AnalysisObject Class
 The AnalysisObject class is an abstract base class for all analysis objects.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 More...
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract class AnalysisObject
Public MustInherit Class AnalysisObject
The AnalysisObject type exposes the following members.
Constructors
Name | Description
AnalysisObject
 Initializes a new instance of the AnalysisObject class.
Top
Properties
Name | Description
AnalysisModelName
 Gets or sets the analysis model name.
AnalysisObjectType
 Gets or sets the type of the analysis object.
FatherObject2ID
 Gets or sets the identifier of the father part.
FatherObject2Type
 Gets or sets the type of the father object.
FatherObjectID
 Gets or sets the identifier of the father part.
FatherObjectType
 Gets or sets the type of the father object.
ID
 Gets or sets the identifier of the analysis object.
Top
Methods
Name | Description
Select
 Selects an analysis object from the database.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisArea
 Tekla.Structures.Analysis.AnalysisAreaPolygon
 Tekla.Structures.Analysis.AnalysisBar
 Tekla.Structures.Analysis.AnalysisCrossSection
 Tekla.Structures.Analysis.AnalysisDecomposedLoad
 Tekla.Structures.Analysis.AnalysisDesignParameterBase
 Tekla.Structures.Analysis.AnalysisEdge
 Tekla.Structures.Analysis.AnalysisFace
 Tekla.Structures.Analysis.AnalysisLoadCombination
 Tekla.Structures.Analysis.AnalysisLoadGroup
 Tekla.Structures.Analysis.AnalysisMaterial
 Tekla.Structures.Analysis.AnalysisMember
 Tekla.Structures.Analysis.AnalysisModel
 Tekla.Structures.Analysis.AnalysisModelConnectivityRule
 Tekla.Structures.Analysis.AnalysisModelLoad
 Tekla.Structures.Analysis.AnalysisNode
 Tekla.Structures.Analysis.AnalysisNodeLink
 Tekla.Structures.Analysis.AnalysisPart
 Tekla.Structures.Analysis.AnalysisPosition
 Tekla.Structures.Analysis.AnalysisRigidDiaphragm
 Tekla.Structures.Analysis.AnalysisSubSection
 Tekla.Structures.Analysis.AnalysisVolume
 Tekla.Structures.Analysis.AnalysisVolumeItem